In [2]:
import pandas as pd

list = [4, 8, 15, 16, 23, 42]

Q.1

In [3]:
df = pd.Series(list)

In [4]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q.2

In [8]:
list = [x for x in 'abcdefghij']

In [10]:
list

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [9]:
df2 = pd.Series(list)

In [12]:
df2

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

Q.3

In [13]:
dict = {'Name':['Alice','Bob','Claire'], 'Age':[25,30,27], 'Gender':['Male', 'Female', 'Male']}

In [14]:
dict

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Male', 'Female', 'Male']}

In [15]:
df3 = pd.DataFrame(dict)

In [16]:
df3

     Name  Age  Gender
0   Alice   25    Male
1     Bob   30  Female
2  Claire   27    Male

Q.4

The Pandas DataFrame is a two-dimensional data structure composed of columns and rows. It is similar to a CSV or relational database table.

The Pandas Series data structure is a one-dimensional labelled array. It is the primary building block for a DataFrame, making up its rows and columns.

In [10]:
df2

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

The above example shows the data in one-dimension as a example of series dataframe. Whereas the dataframe display the data in 2 dimensions as shown below. Also the dataframe is mutable.

In [14]:
df2 = pd.DataFrame(list)
df2

   0
0  a
1  b
2  c
3  d
4  e
5  f
6  g
7  h
8  i
9  j

Q.5.

There are many functions which can be used with Pandas DataFrame. Some common functions are as below:

head() and tail(), info(), dtypes, shape and size etc

please find some examples as below

In [21]:
dict1 = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
        {'a': 100, 'b': 200, 'c': 300, 'd': 400},
        {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]

In [22]:
df4 = pd.DataFrame(dict1)

In [25]:
df4.head()

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [26]:
df4.tail()

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [27]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

Q.6.

Pandas dataframe and panel are mutable in nature

Q.7

By Using concat() method we can create dataframe from multiple series as shown in below example

In [4]:

courses = pd.Series(["Data Science","Web Development","System Design", "Cyber Security"], name='courses', index = [1,2,3,4])

fees = pd.Series([4000,5000,3500, 4500], name='fees',index = [1,2,3,4])

discount  = pd.Series([1000,2300,1000, 1000],name='discount', index = [1,2,3,4])

df=pd.concat([courses,fees,discount],axis=1)

df

           courses  fees  discount
1     Data Science  4000      1000
2  Web Development  5000      2300
3    System Design  3500      1000
4   Cyber Security  4500      1000